Autodesk.Revit.DB.ProfileFamilyUsage
An enumerated type listing all types of profile families.

Autodesk.Revit.DB.ProfileFamilyUsage.StairSupport
Stair Support.

Autodesk.Revit.DB.ProfileFamilyUsage.StairRiser
Stair Riser.

Autodesk.Revit.DB.ProfileFamilyUsage.StairTread
Stair Tread.

Autodesk.Revit.DB.ProfileFamilyUsage.ContinuousFooting
Continuous Footing.

Autodesk.Revit.DB.ProfileFamilyUsage.SlabMetalDeck
Slab Metal Deck.

Autodesk.Revit.DB.ProfileFamilyUsage.Mullion
Mullion.

Autodesk.Revit.DB.ProfileFamilyUsage.StairNosing
Stair Nosing.

Autodesk.Revit.DB.ProfileFamilyUsage.Railing
Railing.

Autodesk.Revit.DB.ProfileFamilyUsage.SlabEdge
Slab edge.

Autodesk.Revit.DB.ProfileFamilyUsage.Gutter
Gutter.

Autodesk.Revit.DB.ProfileFamilyUsage.Fascia
Fascia.

Autodesk.Revit.DB.ProfileFamilyUsage.Reveal
Reveal.

Autodesk.Revit.DB.ProfileFamilyUsage.WallSweep
Wall sweep.

Autodesk.Revit.DB.ProfileFamilyUsage.Any
Any type of profile family.